In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("./data/stock_day.csv")

In [4]:
data.head()

,open,high,close,low,volume,price_change,p_change,ma5,ma10,ma20,v_ma5,v_ma10,v_ma20,turnover
2018-02-27,23.53,25.88,24.16,23.53,95578.03,0.63,2.68,22.942,22.142,22.875,53782.64,46738.65,55576.11,2.39
2018-02-26,22.80,23.78,23.53,22.80,60985.11,0.69,3.02,22.406,21.955,22.942,40827.52,42736.34,56007.50,1.53
2018-02-23,22.88,23.37,22.82,22.71,52914.01,0.54,2.42,21.938,21.929,23.022,35119.58,41871.97,56372.85,1.32
2018-02-22,22.25,22.76,22.28,22.02,36105.01,0.36,1.64,21.446,21.909,23.137,35397.58,39904.78,60149.60,0.90
2018-02-14,21.49,21.99,21.92,21.48,23331.04,0.44,2.05,21.366,21.923,23.253,33590.21,42935.74,61716.11,0.58

In [5]:
data = data.drop(["ma5","ma10","ma20","v_ma5","v_ma10","v_ma20"], axis=1)

In [7]:
data.head()

,open,high,close,low,volume,price_change,p_change,turnover
2018-02-27,23.53,25.88,24.16,23.53,95578.03,0.63,2.68,2.39
2018-02-26,22.80,23.78,23.53,22.80,60985.11,0.69,3.02,1.53
2018-02-23,22.88,23.37,22.82,22.71,52914.01,0.54,2.42,1.32
2018-02-22,22.25,22.76,22.28,22.02,36105.01,0.36,1.64,0.90
2018-02-14,21.49,21.99,21.92,21.48,23331.04,0.44,2.05,0.58

# 索引操作

In [8]:
data["open"]["2018-02-27"]  # 直接索引,必须是先列后行

23.53

In [11]:
# data["2018-02-27"]["open"]

In [13]:
# data[:1 ,:2]

In [14]:
data.loc["2018-02-27":"2018-02-14", "open":"close"]

             open   high  close
2018-02-27  23.53  25.88  24.16
2018-02-26  22.80  23.78  23.53
2018-02-23  22.88  23.37  22.82
2018-02-22  22.25  22.76  22.28
2018-02-14  21.49  21.99  21.92

In [15]:
data.iloc[:5, :3]

             open   high  close
2018-02-27  23.53  25.88  24.16
2018-02-26  22.80  23.78  23.53
2018-02-23  22.88  23.37  22.82
2018-02-22  22.25  22.76  22.28
2018-02-14  21.49  21.99  21.92

In [16]:
data.ix[0:5, ["open", "close"]]

/Users/sherwin/workspaces/ai/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

             open  close
2018-02-27  23.53  24.16
2018-02-26  22.80  23.53
2018-02-23  22.88  22.82
2018-02-22  22.25  22.28
2018-02-14  21.49  21.92

In [17]:
data.loc[data.index[0:5], ["open", "close"]]

             open  close
2018-02-27  23.53  24.16
2018-02-26  22.80  23.53
2018-02-23  22.88  22.82
2018-02-22  22.25  22.28
2018-02-14  21.49  21.92

In [19]:
data.columns.get_indexer(["open", "close"])

array([0, 2])

In [20]:
data.iloc[0:5, data.columns.get_indexer(["open", "close"])]

             open  close
2018-02-27  23.53  24.16
2018-02-26  22.80  23.53
2018-02-23  22.88  22.82
2018-02-22  22.25  22.28
2018-02-14  21.49  21.92

# 赋值操作

In [22]:
data["close"] = 1

In [24]:
data.head()

,open,high,close,low,volume,price_change,p_change,turnover
2018-02-27,23.53,25.88,1,23.53,95578.03,0.63,2.68,2.39
2018-02-26,22.80,23.78,1,22.80,60985.11,0.69,3.02,1.53
2018-02-23,22.88,23.37,1,22.71,52914.01,0.54,2.42,1.32
2018-02-22,22.25,22.76,1,22.02,36105.01,0.36,1.64,0.90
2018-02-14,21.49,21.99,1,21.48,23331.04,0.44,2.05,0.58

In [26]:
data.close = 10

In [27]:
data.head()

,open,high,close,low,volume,price_change,p_change,turnover
2018-02-27,23.53,25.88,10,23.53,95578.03,0.63,2.68,2.39
2018-02-26,22.80,23.78,10,22.80,60985.11,0.69,3.02,1.53
2018-02-23,22.88,23.37,10,22.71,52914.01,0.54,2.42,1.32
2018-02-22,22.25,22.76,10,22.02,36105.01,0.36,1.64,0.90
2018-02-14,21.49,21.99,10,21.48,23331.04,0.44,2.05,0.58

# 排序

In [30]:
data.sort_values(by="open", ascending=False).head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-06-15,34.99,34.99,10,31.69,199369.53,-3.52,-10.00,6.82
2015-06-12,34.69,35.98,10,34.01,159825.88,0.82,2.38,5.47
2015-06-10,34.10,36.35,10,32.23,269033.12,0.51,1.53,9.21
2017-11-01,33.85,34.34,10,33.10,232325.30,-0.61,-1.77,5.81
2015-06-11,33.17,34.98,10,32.51,173075.73,0.54,1.59,5.92

In [32]:
data.sort_values(by=["open", "high"]).head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-03-02,12.25,12.67,10,12.20,96291.73,0.32,2.62,3.30
2015-09-02,12.30,14.11,10,12.30,70201.74,-1.10,-8.17,2.40
2015-03-03,12.52,13.06,10,12.52,139071.61,0.18,1.44,4.76
2015-03-04,12.80,12.92,10,12.61,67075.44,0.20,1.57,2.30
2015-03-05,12.88,13.45,10,12.87,93180.39,0.26,2.02,3.19

In [34]:
data.sort_index().head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-03-02,12.25,12.67,10,12.20,96291.73,0.32,2.62,3.30
2015-03-03,12.52,13.06,10,12.52,139071.61,0.18,1.44,4.76
2015-03-04,12.80,12.92,10,12.61,67075.44,0.20,1.57,2.30
2015-03-05,12.88,13.45,10,12.87,93180.39,0.26,2.02,3.19
2015-03-06,13.17,14.48,10,13.13,179831.72,1.12,8.51,6.16

In [37]:
data["high"].sort_values().head()

2015-03-02    12.67
2015-03-04    12.92
2015-03-03    13.06
2015-09-07    13.38
2015-03-05    13.45
Name: high, dtype: float64

In [39]:
data["high"].sort_index().head()

2015-03-02    12.67
2015-03-03    13.06
2015-03-04    12.92
2015-03-05    13.45
2015-03-06    14.48
Name: high, dtype: float64